module.exports = {
    start: 'Вітаю! Я бот, що вміє видобувати відео з TikTok посилань та надсилати їх у чати.',
    whatFor: 'Для чого цей чат?',
    whatForOptions: {
        source: 'Я хочу поширювати сюди TikTok посилання',
        target: 'Я хочу отримувати тут видобуті відео',
        both: 'Я хочу поширювати і отримувати в одному чаті'
    },
    selectChat: {
        target: 'Тепер перешли наступне повідомлення до чату, де бажаєш отримувати відео.',
        source: 'Тепер перешли наступне повідомлення до чату, куди бажаєш поширювати TikTok посилання.'
    },
    linked: {
        source: "Чудово! Можеш поширювати сюди TikTok посилання.",
        target: "Чудово! Відтепер ти отримуватимеш тут відео.",
        self: "Чудово! Чат налаштовано."
    },
    alreadyLinked: "Вибрані чати вже з'єднано. Продовжуй користуватись.",
    alreadyLinkedSelf: "Цей чат вже налаштовано. Продовжуй користуватись.",
    needAdmin: 'Зроби мене адміністратором, щоб я міг читати усі повідомлення в цій групі.',

    error: {
        link: {
            generic: 'Щось пішло не так. Спробуй розпочати спочатку.',
            badRegistry: 'Схоже ти вже поєднав чати цим повідомленням. Спробуй розпочати спочатку.'
        }
    }
};