module.exports = {
    get(text, ...params) {
        for(var i = 0; i < params.length; ++i)
            text = text.replace(new RegExp(`\\$${i + 1}`, 'g'), params[i]);
        return text;
    },
    start: 'Вітаю! Я бот, що вміє отримувати відео з TikTok посилань та надсилати їх у чати.',
    whatFor: 'Для чого цей чат?',
    whatForOptions: {
        source: 'Я хочу надсилати сюди TikTok посилання',
        target: 'Я хочу отримувати тут відео',
        both: 'Я хочу все в цьому чаті'
    },
    selectChat: {
        target: 'Тепер вибери чат, куди я надсилатиму відео.',
        source: 'Тепер вибери чат, куди ти надсилатимеш TikTok посилання.',
        button: 'Вибрати чат'
    },
    linked: {
        source: "Чудово! Можеш надсилати сюди TikTok посилання.",
        target: "Чудово! Відтепер ти отримуватимеш тут відео.",
        self: "Чудово! Чат налаштовано."
    },
    alreadyLinked: "Вибрані чати вже з'єднано. Продовжуй користуватись.",
    alreadyLinkedSelf: "Цей чат вже налаштовано. Продовжуй користуватись.",
    unlinked: {
        from: "Цей чат більше не надсилатиме до $1.",
        to: "Цей чат більше не отримуватиме з $1.",
        loop: "Чат від'єднано."
    },
    notLinked: "Чат $1 вже від'єднали раніше.",
    notLinkedLoop: "Цей чат вже від'єднали раніше.",
    from: 'Від ',
    blocked: 
`Це відео має додаткові обмеження. Так їх можна обійти:
1. Додай відео до збережених
2. Перейди до свого профілю та відкрий свої збережені відео
3. Відкрий те відео та знову пошир його, і можеш прибрати його зі збережених`,
    invalid: 'Це посилання недійсне.',
    list: {
        to: "Цей чат отримує від:",
        from: "З цього чату отримують:",
        loop: "Цей чат під'єднано до самого себе.",
        nothing: "Немає під'єднаних чатів."
    },
    unlink: {
        to: "Не отримувати від:",
        from: "Не надсилати до:",
        loop: "Від'єднати від самого себе.",
        button: "Від'єднати"
    },

    error: {
        link: {
            generic: 'Щось пішло не так. Спробуй розпочати спочатку.',
            badRegistry: 'Схоже ти вже використав цей ідентифікатор. Спробуй розпочати спочатку.'
        }
    }
};